[frmMain]
mnuLanguage.Caption=lingua(Language)

pmnuExitTheSystem.Caption=Esci dal sistema

mnuSystemSettings.Caption=Impostazioni del sistema
mnuParameterSetting.Caption=Impostazione dei parametri
mnuBootUp.Caption=Boot up
mnuExitTheSystem.Caption=Esci dal sistema

mnuReportTools.Caption=Strumenti di segnalazione
mnuReportDesign.Caption=Disegno dei rapporti

mnuPrintLog.Caption=Visualizza registro di stampa


mnuJsonTools.Caption=Strumento di validazione JSON(bejson.com)
mnuBase64.Caption=Base64 e conversione di immagini
mnuUrlEncode.Caption=Codifica URL / decodifica
mnuSSLTools.Caption=Strumento di conversione del formato del certificato SSL
mnuOpenTheRootDirectory.Caption=Apri la directory root
mnuOpenReportDirectory.Caption=Apri cartella di report
mnuOpenLogDirectory.Caption=Apri cartella log
mnuOpenTheOutputfileDirectory.Caption=Apri la directory del file di output
mnuWindowDisplay.Caption=Visualizzazione della finestra
mnuHttpPrint.Caption=Stampa HTTP
mnuMqttPrint.Caption=stampa Mqtt
mnuCamera.Caption=fotocamera
mnuIdCard.Caption=ID
mnuGridreport.Caption=Gridreport
mnuFastreport.Caption=Fastreport
mnuReportmachine.Caption=Reportmachine
mnuSystemHelp.Caption=Aiuto di sistema
mnuAboutUs.Caption=Su di noi

ts_http_print.Caption=Stampa HTTP
lblPort.Caption=porto
rb_print.Caption=Stampa
rb_Preview.Caption=anteprima
ButtonStart.Caption=start-up
ButtonStop.Caption=La smetta.

ts_mqtt_print.Caption=stampa Mqtt
gb_mqtt.Caption=Server Mqtt
lbl_mqtt_server_address.Caption=indirizzo
lbl_mqtt_server_port.Caption=porto
lbl_mqtt_server_username.Caption=nome utente
lbl_mqtt_server_userpwd.Caption=password
lbl_mqtt_server_subscribe_topic.Caption=Iscriviti a temi
lbl_mqtt_server_print_verification_code.Caption=Codice di verifica stampa
ButtonStart_mqtt.Caption=start-up
ButtonStop_mqtt.Caption=La smetta.

ts_camera.Caption=fotocamera
lbl_camera_device_list.Caption=Elenco delle apparecchiature
lbl_camera_resolution.Caption=risoluzione del potere
btn_open_camera.Caption=Avvia la fotocamera
btn_close_camera.Caption=Spegni la telecamera
chk_auto_open_camera.Caption=Avvia macchina fotografica
chk_pal_b.Caption=Prevenire lo schermo flash
chk_auto_top.Caption=Top Form (sempre in alto)

ts_idcard.Caption=ID
lbl_idcard_name.Caption=nome completo
lbl_idcard_sex.Caption=Genere
lbl_idcard_nation.Caption=nazione
lbl_idcard_birthday.Caption=data di nascita
lbl_idcard_id.Caption=Numero identificativo
lbl_idcard_org.Caption=firma e emittente
lbl_idcard_addr.Caption=indirizzo
lbl_idcard_begin.Caption=Inizio della validità
lbl_idcard_end.Caption=Fine della validità
lbl_idcard_type.Caption=Tipo di apparecchiatura
btn_idcard_read.Caption=leggere
lbl_idcard_msg.Caption=Suggerimenti di messaggio:

[frmAbout]
btnOk.Caption=determinare
Caption=circa

[LanguageString]
ini_NeedRegister=Troppe volte di stampa, si prega di riavviare il plug in di stampa o acquistare la versione OEM
ini_NoToken=Token valore non esiste
ini_ReadIdCardError=Message prompt: la lettura della scheda non riuscita!
ini_GetPrinterList=Ottenere lista di stampante
ini_CreateDir=Crea cartella
ini_FailPleaseCheck=Fallito, controlla
ini_PrintFailPleaseCheck=Stampa non riuscita, controlla
ini_ReportFileNotExist=Il file di rapporto non esiste
ini_DownLoadError=Errore di download
ini_JsonFormatError=Errore di formato JSON
ini_PrintingTimeoutPleaseCheck=Tempo di stampa, controlla
ini_PictureFormatError=Il formato immagine non è corretto
ini_PdfFileNotExist=Il file Pdf non esiste
ini_PicFileNotExist=Pic file non esiste
ini_This=La
ini_NotSupport=Non lo sosterrò.
ini_InterfaceCallFailed=Interface call non riuscita
ini_CameraNotActivated=Camera non attivata
ini_SelectFolder=Seleziona cartella
ini_MinutesMustBeAnInteger=Il processo verbale deve essere un intero
ini_MinutesMustBeGreaterThanZero=Il processo verbale deve essere superiore a zero
ini_SelfStartingClientNameCannotBeEmpty=Il nome del client di partenza non può essere vuoto


ini_PdfFileCannotOpen=Pdf file non può essere aperto
ini_LicenseKeyInvalid=Chiave di licenza non valida


ini_PicFileCannotOpen=Pic file non può essere aperto
ini_UnableInitializePrinter=Impossibile inizializzare la stampante
ini_PicPrint=Stampa di immagini
ini_PaperSize=Dimensione della carta
ini_CustomMM=personalizzata(MM)
ini_Width=larghezza
ini_Height=altezza
ini_PrintingDirection=Direzione di stampa
ini_landscape=trasversale
ini_portrait=verticale
ini_MarginMM=Margini(MM)
ini_Left=Sinistra
ini_Right=destro
ini_Top=superiore
ini_Bottom=inferiore
ini_Center=metà
ini_VerticalPos=Posizione verticale
ini_HorizontalPos=Posizione orizzontale
ini_Copys=Numero di copie
ini_DocumentTitle=titolo del documento
ini_PrinterName=Nome della stampante
ini_PageZoom=Zoom di pagina
ini_Normal=Determinare la dimensione di stampa dall'immagine original e DPI (cioè creare una copia di dimensione vera)
ini_FitToPage=Estendere l'immagine per adattarsi alla pagina nel rispetto della sua scala
ini_FitToPageStretch=Estendere l'immagine per adattarsi alla pagina, ignorando la scala
ini_FillPage=Estendere l'immagine per riempire l'intera pagina (in base alla sua scala)
ini_SpecifiedSize=Stampa alle dimensioni assolute specificate dai parametri assoluti di larghezza e altezza
ini_MultiplePages=Stampa immagini (poster) su più pagine con conti specificati per larghezza assoluta e parametri di altezza assoluta
ini_SpecWidth=Larghezza assoluta
ini_SpecHeight=Altezza assoluta
ini_LoadPic=Carica immagini
ini_ConfirmPrinting=Conferma la stampa



ini_PrintLog=Stampa log
ini_Date=data
ini_Refresh=Aggiorna
ini_OpenLogDirectory=Apri cartella log
ini_OpenOutputFileDirectory=Apri la directory del file di output
ini_ViewCustomFile=Visualizza file personalizzato
ini_LogList=Log list
ini_LogContent=Contenuto di registro
ini_PdfFile=File Pdf
ini_Directory=catalogo
ini_NotExist=inesistente


ini_ReportDesign=Disegno dei rapporti
ini_DoubleClickToOpenTheReportFile=Fare doppio clic per aprire il file di rapporto
ini_NewlyAdded=aggiungere a
ini_Modify=modifica
ini_Delete=eliminare
ini_Copy=Ricevuto.
ini_ReportDoesNotExist=La relazione non esiste
ini_To=A
ini_Error=errore
ini_InTheListBelow_selectTheReportFileYouWantToModify=Nell'elenco sottostante, selezionare il file di rapporto che si desidera modificare
ini_TestReport=Rapporto di prova
ini_AreYouSureYouWantToDelete=Sei sicuro di voler cancellare
ini_DeleteConfirmation=Elimina conferma
ini_YouHaveChosenNotToDelete=Hai scelto di non eliminare
ini_ReportNameEn=Nome del rapporto
ini_ReportNameAlias=Denominazione di rapporto (alias)
ini_VersionNumber=Numero di versione
ini_FileNameSuffixMustBe=Il suffisso del nome del file deve essere
ini_Currently=Attualmente
ini_TheFileNameAlreadyExists=Il nome del file esiste già
ini_ReportInfo=Informazioni di segnalazione




ini_NoJsonFile=Manca il file JSON
ini_PrintErrorJsonError=Errore di stampa, formato JSON
ini_MustBe=Deve essere...
ini_Or=forse
ini_ReportName=Nome del rapporto
ini_CannotBeEmpty=Impossibile essere vuoto
ini_MustBeIntOrFloat=Deve essere un tipo decimale o intero
ini_DeleteLocalReportFile=Elimina file di rapporto locale
ini_DownLoadReportFileToLocal=Scarica il rapporto remoto a locale
ini_DownLoadReportFileError=Errore nel scaricare file di report
ini_DownLoadComplete=Scarica completo
ini_EditLocalReportVersion=Modifica il numero di versione della relazione locale
ini_CreateReportFile=Crea file di rapporto
ini_PrintCopys=Numero di copie stampate
ini_MustBeInt=Deve essere un tipo intero
ini_MustBeGreaterThanOrEqualTo=Deve essere più grande o uguale a zero
ini_DetermineIfThePrinterExists=Determinare se la stampante esiste
ini_Printer=stampante
ini_NotExistPayAttentionToCaseAndSpace=No, si prega di prestare attenzione al caso e spazio
ini_SetRightOffset=Imposta offset destro
ini_MustBeFloat=Deve essere un tipo di punto galleggiante
ini_SetBottomOffset=Imposta offset base
ini_MustBeOneOrZero=Deve essere 1 o 0
ini_SetComponent=Imposta il riquadro
ini_Component=Componente box
ini_ControlToArrayError=Errore nel convertire il controllo in array
ini_LoadPicError=Errore nel caricamento dell'immagine
ini_FormatError=Formato errato
ini_Parameter=parametro
ini_ParameterToArrayError=Errore nel convertire il parametro in array
ini_Field=campo
ini_FieldToArrayError=Errore nel convertire Field in array
ini_AFieldToArrayError=Errore nel convertire AField in array
ini_BFieldToArrayError=Errore nel convertire BField in array
ini_CFieldToArrayError=Errore nel convertire CField in array
ini_DFieldToArrayError=Errore nel convertire DField in array
ini_EFieldToArrayError=Errore nel convertire EField in array
ini_FFieldToArrayError=Errore nel convertire FField in array
ini_GFieldToArrayError=Errore nel convertire GField in array
ini_HFieldToArrayError=Errore nel convertire HField in array
ini_IFieldToArrayError=Errore nel convertire IField in array
ini_JFieldToArrayError=Errore nel convertire JField in array
ini_DataRow=riga dati
ini_DataToArrayError=Errore nel convertire Data in array
ini_ADataToArrayError=Errore nel convertire AData in array
ini_BDataToArrayError=Errore nel convertire BData in array
ini_CDataToArrayError=Errore nel convertire CData in array
ini_DDataToArrayError=Errore nel convertire DData in array
ini_EDataToArrayError=Errore nel convertire EData in array
ini_FDataToArrayError=Errore nel convertire FData in array
ini_GDataToArrayError=Errore nel convertire GData in array
ini_HDataToArrayError=Errore nel convertire HData in array
ini_IDataToArrayError=Errore nel convertire IData in array
ini_JDataToArrayError=Errore nel convertire JData in array
ini_SetOffsetValue=Imposta valore di offset
ini_SetPrinterName=Imposta nome della stampante
ini_ExportFileYes=Vuoi esportare il file sì
ini_ExportFileName=Esporta nome del file
ini_ExportComplete=Esportazione completa
ini_PreviewComplete=Anteprima completata
ini_PrintComplete=Finita stampa
ini_LoadReport=Rapporto di carico
ini_ADataToArraySuccess=Adata convertita in array con successo
ini_BDataToArraySuccess=Bdata convertita in array con successo
ini_CDataToArraySuccess=Cdata convertita in array con successo
ini_DDataToArraySuccess=Ddata convertita in array con successo
ini_EDataToArraySuccess=Edata convertita in array con successo
ini_FDataToArraySuccess=Fdata convertita in array con successo
ini_GDataToArraySuccess=Gdata convertita in array con successo
ini_HDataToArraySuccess=Hdata convertita in array con successo
ini_IDataToArraySuccess=Idata convertita in array con successo
ini_JDataToArraySuccess=Jdata convertita in array con successo




ini_NoClientID=Non c'è valore per il client ID
ini_ClientIDEmpty=ClientID non può essere vuoto
ini_PrinteridWrong=Stampante non è corretto
ini_PrinterpwdWrong=La stampante è sbagliata
ini_MethodWrong=Metodo errato
ini_PingSuccessful=Ping riuscito
ini_PingTimeout=Ping timeout
ini_ConnectionResults=Risultati della connessione
ini_subscribeResultMessageID=Il risultato dell'abbonamento, l'ID del messaggio
ini_UnsubscribeResultMessageID=Annulla risultato, ID messaggio
ini_Received_release_confirmation_QoS_1_message_ID=Conferma di rilascio ricevuta QoS 1, ID messaggio
ini_Receive_release_confirmation_step_1_of_QoS_2_message_ID=Ricevi passo di conferma del rilascio 1 di QoS 2, ID del messaggio
ini_Receive_release_confirmation_step_3_of_QoS_2_message_ID=Ricevi passo di conferma del rilascio 3 di QoS 2, ID del messaggio
ini_Receive_release_confirmation_step_2_of_QoS_2_message_ID=Ricevi passo di conferma del rilascio 2 di QoS 2, ID del messaggio
ini_ConnectionTimedOut=Tempo di connessione scaduto
ini_PublishingTimeout=Periodo di pubblicazione
ini_MessageID=ID messaggio
ini_Topic=tema
ini_Content=contenuto
ini_CameraOn=Fotocamera accesa
ini_OpenFailed=Apri non riuscito
ini_NoVideoDevicesWereFound=Non sono stati trovati dispositivi video
ini_Stopped=Stoppato
ini_CameraStartFailed=Avvio della fotocamera non riuscito
ini_CameraOff=Camera spenta
ini_Disconnect=Disconnesso
ini_Started=Inizio
ini_Failed_to_start_Please_try_another_port=Impossibile avviare. Prova un'altra porta
ini_Minimum_desktop_requirements_Windows_Vista=Requisiti minimi del desktop: Windows Vista
ini_Minimum_server_requirements_Windows_Server_2008=Requisiti minimi del server: Windows Server 2008







ini_Table_structure_field_type=Tipo di campo di struttura tabella ftblob (formato Base64), ftstringa, ftftfteleteger, ftboolean, ftfloat, ftcurrency, ftdatetime,
ini_size_ftString_ftInteger_ftBlob=Dimensione (ftstringa è impostato alla lunghezza effettiva, altre sono impostate su 0, per esempio, ftblob ftblob è impostato su 0)
ini_Currently_10_tables_are_supported=Attualmente sono supportate 10 tabelle abcdefghij. Ad esempio, tabella a contiene un adata di campo fino alla tabella J contiene jfield jdata




ini_ParameterSetting=Impostazione dei parametri
ini_Log_save_path_if_empty_the_default_is_log_directory=Percorso di salvataggio di log (se vuoto, la directory di default è log)
ini_Clear_log_on_startup=Pulisci il log all'avvio
ini_Clear_log_on_exit=Cancella il log all'uscita
ini_In_operation_every=Durante l'operazione, vuota una volta ogni XX minuti
ini_Save_settings=Salva le impostazio
ini_journal=ni
ini_report_form=rivista
ini_Report_template_path_empty_default_report_directory=Percorso del modello di rapporto (cartella di rapporto predefinito vuota)
ini_Export_file_path_empty_default_export_directory=Percorso file di esportazione (cartella di esportazione predefinita vuota)
ini_Export_file_format_blank_default_PDF_format=Esporta formato file (bianco, formato PDF predefinito)
ini_Enable_token=Attiva gettone
ini_Token_list_one_for_each_line_similar_to_white_list=Token list (una per ogni riga, simile alla lista bianca)
ini_other=altro
ini_Minimize_after_startup=Minimizza dopo l'avvio
ini_Customize_the_client_name_so_that_it_can_start_multiple_clients=Personalizza il nome del cliente in modo che possa avviare più client





ini_URL_encoding_decoding=Codifica URL / decodifica
ini_URLEncode=URLEncode
ini_URLDecode=decodifica URLDecode





ini_Base64_and_image_conversion=Base64 e conversione di immagini
ini_exceed_100k=Per bilanciare l'efficienza nell'ambiente di produzione, generalmente un singolo file di immagini non dovrebbe superare 100k.
ini_Base64_string=Base64 stringa
ini_paste=pasta
ini_Turn_to_picture=Gira alla foto
ini_picture=immagini


ini_Connection=connect
ini_write_log=Genera registri